Revit 2027 API
Transform2D.Determinant Property
 The determinant of this transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Determinant { get; }
Public ReadOnly Property Determinant As Double
	Get
public:
property double Determinant {
	double get ();
}
member Determinant : float with get
Property Value
Double
Remarks
 The geometric meaning of a determinant is as the scale factor for volume when applied as linear transformation.
See Also
Reference
Transform2D Class
Autodesk.Revit.DB Namespace